app/Http/Controllers/Auth/RegisteredUserController.php

    public function store(Request $request): \Symfony\Component\HttpFoundation\Response
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|string|lowercase|email|max:255|unique:'.User::class,
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $rule = in_array($request->getHost(), config('tenancy.central_domains') ) &&
         Str::contains( $request->name, '@admin')?
         'admin':'user';

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
            'rule' => $rule,
        ]);
---
insert into "users" ("name", "email", "password", "rule", "updated_at", "created_at") values ('sarmad', 'sarmad@example.test', '$2y$12$rVFr3K9YC6tOG0MrvctoS.DE6TU54XGg7tKxo94F4c6AcBGXkFxc.', 'user', '2025-05-12 03:21:13', '2025-05-12 03:21:13')