app/Http/Middleware/HasStore.php

select exists(select * from "tenants" where "email" = 'sarmad@example.test') as "exists"
---
    public function handle(Request $request, Closure $next): Response
    {
        if ($request->user()->rule === 'user' && !Tenant::where('email', $request->user()->email)->exists()) {