app/Http/Controllers/StoreController.php

    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'description' => 'nullable|string',
            'domain' => 'required|string|max:255',
            'logo' => 'nullable|image|mimes:jpeg,png,jpg,gif,svg|max:3072',
        ]);

        if (!$request->user()) {
            return redirect()->route('login')->with('error', 'You must be logged in to create a store.');
        } elseif (Tenant::where('email', $request->user()->email)->exists()) {
            return redirect()->route('home')->with('error', 'You already have a store associated with this email.');
        }


        if ($logo = $request->file('logo')) {
            $logoName = date('YmdHis') . '.' . $logo->getClientOriginalExtension();
            $logo->move(public_path('logos'), $logoName);
        }

        $tenant = Tenant::create([
            'name' =>  $request->name,
            'description' => $request->description,
            'email' => $request->user()->email,
            'password' => $request->user()->password,
            'logo' => $logoName,
        ]);
---
insert into "tenants" ("name", "email", "password", "data", "id", "updated_at", "created_at") values ('sarmadStore', 'sarmad@example.test', '$2y$12$rVFr3K9YC6tOG0MrvctoS.DE6TU54XGg7tKxo94F4c6AcBGXkFxc.', '{"description":null,"logo":null}', '4d40195b-a1cf-4e44-9988-d5d3e7866bb1', '2025-05-12 03:26:09', '2025-05-12 03:26:09')