app/Jobs/CreateTenantUser.php

update "users" set "rule" = 'vendor', "updated_at" = '2025-05-12 03:26:09' where "id" = 1
---
    public function updateUserRole($user): void
    {
        $user->rule = 'vendor';
        $user->save();